In [1]:
import numpy as np
import pandas as pd

In [3]:
data = np.random.randint(1,100,(10,3))

In [4]:
data

array([[11, 94, 64],
       [28, 33, 21],
       [29, 93, 17],
       [15, 31, 84],
       [60, 30,  6],
       [93, 19, 19],
       [ 6, 75, 59],
       [34, 46, 32],
       [ 3, 80, 75],
       [43, 99, 47]])

In [5]:
df = pd.DataFrame(data, columns= ["Col1","Col2","Col3"])

In [6]:
df

   Col1  Col2  Col3
0    11    94    64
1    28    33    21
2    29    93    17
3    15    31    84
4    60    30     6
5    93    19    19
6     6    75    59
7    34    46    32
8     3    80    75
9    43    99    47

In [7]:
df.Col1 < 30

0     True
1     True
2     True
3     True
4    False
5    False
6     True
7    False
8     True
9    False
Name: Col1, dtype: bool

In [13]:
df.Col1

0    11
1    28
2    29
3    15
4    60
5    93
6     6
7    34
8     3
9    43
Name: Col1, dtype: int32

In [14]:
df["Col1"]

0    11
1    28
2    29
3    15
4    60
5    93
6     6
7    34
8     3
9    43
Name: Col1, dtype: int32

In [16]:
df[0:5][["Col1","Col3"]] ## fancy [[]]

   Col1  Col3
0    11    64
1    28    21
2    29    17
3    15    84
4    60     6

In [17]:
df

   Col1  Col2  Col3
0    11    94    64
1    28    33    21
2    29    93    17
3    15    31    84
4    60    30     6
5    93    19    19
6     6    75    59
7    34    46    32
8     3    80    75
9    43    99    47

In [21]:
df[df.Col1 <30]["Col3"] # the line chosen that Col1 values smaller 30 and display column3 depend chosen lines

0    64
1    21
2    17
3    84
6    59
8    75
Name: Col3, dtype: int32

In [23]:
 df[ (df.Col1 < 30) & (df.Col3 > 30) ]

   Col1  Col2  Col3
0    11    94    64
3    15    31    84
6     6    75    59
8     3    80    75

In [24]:
df.loc[ (df.Col1 > 10), ["Col1","Col2"]]

   Col1  Col2
0    11    94
1    28    33
2    29    93
3    15    31
4    60    30
5    93    19
7    34    46
9    43    99

In [25]:
df[(df.Col1 > 50)][["Col3","Col2"]]

   Col3  Col2
4     6    30
5    19    19